import Layout from '../../components/Layout'
import Head from 'next/head'
import Link from 'next/link'

export default () => (
  <Layout>
    <Head>
      <title>Liara | تهیه‌ی SSL رایگان - Let's Encrypt Free HTTPS</title>
    </Head>

    <h3>تهیه‌ی SSL رایگان</h3>
    <p>
      بعد از ایجاد هر پروژه در لیارا، یک ساب‌دامنه‌ی اختصاصی به شما اختصاص داده می‌شود.
      برای مثال، اگر نام پروژه‌ی‌تان my-app باشد،
      ساب‌دامنه‌ی my-app.liara.run
      به شما اختصاص داده می‌شود که از طریق آن می‌توانید به پروژه‌ی‌تان دسترسی داشته باشید.
    </p>

    <h3>تنظیمات لازم در CDN ها</h3>
    <p>
      اگر سرویس‌هایی مانند Cloudflare استفاده می‌کنید،
      باید ابر نارنجی را غیر فعال کنید.
      {/* TODO: explain more with pictures */}
    </p>


    <h3>تهیه‌ی HTTPS برای Subdomain</h3>


    <h3>از دامنه‌های .ir هم پشتیبانی می‌کنید؟</h3>
    <p>
      بله. شما می‌توانید 
    </p>

    <h3>آیا HTTPS شما معتبر است؟</h3>
    <p>
      برای خرید دامنه، در حال حاظر سرویس‌های مختلفی وجود دارند که با قیمت مناسبی
      امکان خرید دامنه را برای‌تان فراهم می‌کنند. برای سرویس DNS هم همین‌طور.
      در حال حاظر، برنامه‌ی ما این است که سرویس‌هایی را ارائه دهیم که کمبود آن‌ها احساس می‌شود.
      شاید در آینده این خدمات را هم ارائه دهیم.
    </p>

    <h3>چه تفاوتی بین HTTPS رایگان و غیر رایگان وجود دارد؟</h3>
  </Layout>
)